backend/billing/billing-api/src/test/resources/billing/invoice/invoiceCreated.json

{
  "account": null,
  "api_version": "2020-08-27",
  "created": 1600979347,
  "data": {
    "previous_attributes": null,
    "object": {
      "id": "in_1HS6JBI1ysvdCIIxTy8CIG2f",
      "object": "invoice",
      "account_country": "SI",
      "account_name": "Insight",
      "amount_due": 1500,
      "amount_paid": 0,
      "amount_remaining": 1500,
      "application_fee_amount": null,
      "attempt_count": 0,
      "attempted": true,
      "auto_advance": true,
      "billing_reason": "subscription_create",
      "charge": null,
      "collection_method": "charge_automatically",
      "created": 1600979346,
      "currency": "usd",
      "custom_fields": null,
      "customer": "cus_I5BQDc7zI19WNF",
      "customer_address": null,
      "customer_email": "ematej.snuderl@gmail.com",
      "customer_name": null,
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "due_date": null,
      "ending_balance": 0,
      "footer": null,
      "hosted_invoice_url": "https://pay.stripe.com/invoice/acct_1HRYgqI1ysvdCIIx/invst_I5BQPwltXm305VcaOrZrGcn88sEbb1D",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1HRYgqI1ysvdCIIx/invst_I5BQPwltXm305VcaOrZrGcn88sEbb1D/pdf",
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1HV13uI1ysvdCIIxKwgWPPkQ",
            "object": "line_item",
            "amount": 1500,
            "currency": "usd",
            "description": "1 ? Billing Guide: Premium Service (at $15.00 / month)",
            "discount_amounts": [],
            "discountable": true,
            "discounts": [],
            "livemode": false,
            "metadata": {},
            "period": {
              "end": 1603571346,
              "start": 1600979346
            },
            "plan": {
              "id": "price_1HRjvtI1ysvdCIIxwuxy4FEI",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 1500,
              "amount_decimal": "1500",
              "billing_scheme": "per_unit",
              "created": 1600198517,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "product": "prod_I1bvMWginyIvlU",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1HRjvtI1ysvdCIIxwuxy4FEI",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1600198517,
              "currency": "usd",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "product": "prod_I1bvMWginyIvlU",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 1500,
              "unit_amount_decimal": "1500"
            },
            "proration": false,
            "quantity": 1,
            "subscription": "sub_I5BQ6NFX2nejLH",
            "subscription_item": "si_I5BQsNKn4docda",
            "tax_amounts": [],
            "tax_rates": [],
            "type": "subscription"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1HV13uI1ysvdCIIxCcN45ACx/lines"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": null,
      "number": "6ED8CCF9-0329",
      "paid": false,
      "payment_intent": "pi_1HV13uI1ysvdCIIxHdl6D8QP",
      "period_end": 1600979346,
      "period_start": 1600979346,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "receipt_number": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "open",
      "status_transitions": {
        "finalized_at": 1600979346,
        "marked_uncollectible_at": null,
        "paid_at": null,
        "voided_at": null
      },
      "subscription": "sub_I5BQ6NFX2nejLH",
      "subtotal": 1500,
      "tax": null,
      "total": 1500,
      "total_discount_amounts": [],
      "total_tax_amounts": [],
      "transfer_data": null,
      "webhooks_delivered_at": null
    }
  },
  "id": "evt_1HV13vI1ysvdCIIxfldAHzmW",
  "livemode": false,
  "object": "event",
  "pending_webhooks": 2,
  "request": {
    "id": "req_dFBFHenlt9Lw4i",
    "idempotency_key": "df0e8748-9ddd-432a-9fee-7f996d28d045"
  },
  "type": "invoice.created"
}
