backend/billing/billing-api/src/test/resources/billing/invoice/subscriptionUpdated3DSecure.json

{
  "account": null,
  "api_version": "2020-08-27",
  "created": 1600980735,
  "data": {
    "previous_attributes": {
      "status": "incomplete"
    },
    "object": {
      "id": "sub_I5BnHjyEOZTJU7",
      "object": "subscription",
      "application_fee_percent": null,
      "billing_cycle_anchor": 1600980703,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1600980703,
      "current_period_end": 1603572703,
      "current_period_start": 1600980703,
      "customer": "cus_I5Bn4eYlhxsqbz",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_I5BnHKPjmA2YKf",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1600980704,
            "metadata": {},
            "plan": {
              "id": "price_1HRjvtI1ysvdCIIxwuxy4FEI",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 1500,
              "amount_decimal": "1500",
              "billing_scheme": "per_unit",
              "created": 1600198517,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "product": "prod_I1bvMWginyIvlU",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1HRjvtI1ysvdCIIxwuxy4FEI",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1600198517,
              "currency": "usd",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "product": "prod_I1bvMWginyIvlU",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 1500,
              "unit_amount_decimal": "1500"
            },
            "quantity": 1,
            "subscription": "sub_I5BnHjyEOZTJU7",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription\u003dsub_I5BnHjyEOZTJU7"
      },
      "latest_invoice": "in_1HV1PnI1ysvdCIIxV2jkINgr",
      "livemode": false,
      "metadata": {},
      "next_pending_invoice_item_invoice": null,
      "pause_collection": null,
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "id": "price_1HRjvtI1ysvdCIIxwuxy4FEI",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 1500,
        "amount_decimal": "1500",
        "billing_scheme": "per_unit",
        "created": 1600198517,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "nickname": null,
        "product": "prod_I1bvMWginyIvlU",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1600980703,
      "status": "active",
      "transfer_data": null,
      "trial_end": null,
      "trial_start": null
    }
  },
  "id": "evt_1HV1QKI1ysvdCIIxyB4TX3qs",
  "livemode": false,
  "object": "event",
  "pending_webhooks": 2,
  "request": {
    "id": null,
    "idempotency_key": "pi_1HV1PnI1ysvdCIIxrBuGQ9sn-src_1HV1PpI1ysvdCIIxzsTcTmQ0"
  },
  "type": "customer.subscription.updated"
}
